Revit 2026 API

# FamilyInstancePlacingArgs Class

---

The class is used to access necessary data during the placement of a FamilyInstance.

SystemObject Autodesk.Revit.UIFamilyInstancePlacingArgs

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FamilyInstancePlacingArgs : IDisposable
```
```vb
Public Class FamilyInstancePlacingArgs
	Implements IDisposable
```
```cpp
public ref class FamilyInstancePlacingArgs : IDisposable
```
```fsharp
type FamilyInstancePlacingArgs =
    class
        interface IDisposable
    end
```

The FamilyInstancePlacingArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ActiveView | The active view |
|  | IsBanned | Indicates if the cursor is banned or not. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | StatusMessage | The message to be shown on the status bar |
|  | TooltipMessage | The message to be shown via tooltip |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FamilyInstancePlacingArgs |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI Namespace